public_html/articles/emacs/first-step-emacs.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Дифирамбы</a></li>
<li><a href="#unnumbered-2">Непохожесть</a></li>
<li><a href="#unnumbered-3">Установка</a></li>
<li><a href="#unnumbered-4">Начало работы</a></li>
</ul>
</div>
</div>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Дифирамбы</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Без восхищения Емаксом не обходится ни одна статья о нем, но я буду
краток - он просто лучший и в нем есть все. Это все очень удобно
настраивается и в этой серии статей я покажу как превратить
стандартный Емакс в удобную операционную систему для работы.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Непохожесть</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Первоначально, когда вы открываете только что установленный Емакс он
выглядит очень необычно - отсутствие привычных элементов управления
пугает. Зато потом, по мере понимания его философии вы понимаете,
здесь все иначе, но все - правильно!
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Установка</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
На debian и ubuntu linux установка производится одной командой:
</p>

<p>
&lt;code&gt;sudo apt-get install emacs&lt;/code&gt;
</p>

<p>
В других случаях читайте официальные рекомендации по установке.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Начало работы</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Чтобы начать работать с Емаксом нужно знать три вещи:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Как из него выйти</td>
<td class="left">C-x C-c</td>
</tr>

<tr>
<td class="left">Как открыть файл</td>
<td class="left">C-x C-f</td>
</tr>

<tr>
<td class="left">Как сохранить файл</td>
<td class="left">C-x C-s</td>
</tr>
</tbody>
</table>


<p>
Что значат эти обозначения во второй колонке? Это последовательность
нажатий клавиш С-x значить Ctrl+x, т.е. удерживая "Control", нажать
"x". Пробел между комбинациями - отпустить все клавиши. Т.е.
комбинация C-x C-s это нажать Ctrl-x, отпустить, потом нажать Ctrl+s
</p>

<p>
Дальше будет веселее - оставайтесь с нами!
</p>
</div>
</heading>
